Public Attributes | List of all members
API_RailingHandrailConnectionQuantity Struct Reference
Element Manager API
Calculated values for the handrail connection. More...
#include <APIdefs_Elements.h>
 Public Attributes
double  | volume
Volume of the handrail connection.
double  | length3D
Length of the 3D reference line of the handrail connection.
Detailed Description
Calculated values for the handrail connection.
Member Data Documentation
◆ length3D
 API_RailingHandrailConnectionQuantity::length3D
Length of the 3D reference line of the handrail connection.
◆ volume
 API_RailingHandrailConnectionQuantity::volume
Volume of the handrail connection.